loadrunner/LB_Scrips_and_Scenario/01.scripts/01_SOAPTOTCP/SOAPtoTCP/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:biz="http://bizhub.kt.com">
   <soapenv:Header>
      <biz:commonHeader>
         <biz:appName>?</biz:appName>
         <biz:svcName>PTPK</biz:svcName>
         <biz:fnName>5090</biz:fnName>
         <!--Optional:-->
         <biz:fnCd>?</biz:fnCd>
         <biz:globalNo>111111111111</biz:globalNo>
         <biz:chnlType>?</biz:chnlType>
         <!--Optional:-->
         <biz:envrFlag>?</biz:envrFlag>
         <biz:trFlag>?</biz:trFlag>
         <biz:trDate>?</biz:trDate>
         <biz:trTime>?</biz:trTime>
         <biz:clntIp>?</biz:clntIp>
         <biz:responseType>?</biz:responseType>
         <!--Optional:-->
         <biz:responseCode>?</biz:responseCode>
         <!--Optional:-->
         <biz:responseLogcd>?</biz:responseLogcd>
         <!--Optional:-->
         <biz:responseTitle>?</biz:responseTitle>
         <!--Optional:-->
         <biz:responseBasc>?</biz:responseBasc>
         <!--Optional:-->
         <biz:responseDtal>?</biz:responseDtal>
         <!--Optional:-->
         <biz:responseSystem>?</biz:responseSystem>
         <biz:userId>?</biz:userId>
         <!--Optional:-->
         <biz:realUserId>?</biz:realUserId>
         <biz:filler>?</biz:filler>
         <biz:langCode>?</biz:langCode>
         <biz:orgId>?</biz:orgId>
         <biz:srcId>?</biz:srcId>
         <!--Optional:-->
         <biz:curHostId>?</biz:curHostId>
         <biz:lgDateTime>?</biz:lgDateTime>
         <!--Optional:-->
         <biz:tokenId>?</biz:tokenId>
         <!--Optional:-->
         <biz:cmpnCd>?</biz:cmpnCd>
         <!--Optional:-->
         <biz:lockType>?</biz:lockType>
         <!--Optional:-->
         <biz:lockId>?</biz:lockId>
         <!--Optional:-->
         <biz:lockTimeSt>?</biz:lockTimeSt>
         <!--Optional:-->
         <biz:businessKey>?</biz:businessKey>
         <!--Optional:-->
         <biz:arbitraryKey>?</biz:arbitraryKey>
         <biz:resendFlag>?</biz:resendFlag>
      </biz:commonHeader>
   </soapenv:Header>
   <soapenv:Body>
      <biz:MSGIReqBody>
         <biz:bizHeader>
            <!--Optional:-->
            <biz:orderId>?</biz:orderId>
            <biz:cbSvcName>?</biz:cbSvcName>
            <biz:cbFnName>?</biz:cbFnName>
         </biz:bizHeader>
         <biz:MSGIReqSubBody>
            <biz:trtDiv>I</biz:trtDiv>
            <biz:datType>R</biz:datType>
            <!--Optional:-->
            <biz:bizrIdfyCd>B060</biz:bizrIdfyCd>
            <!--Optional:-->
            <biz:resno>7101022780727???</biz:resno>
            <!--Optional:-->
            <biz:divCd>1</biz:divCd>
            <!--Optional:-->
            <biz:custNm>?</biz:custNm>
            <biz:rqtDiv>1</biz:rqtDiv>
            <!--Optional:-->
            <biz:connrId>10035054??</biz:connrId>
            <!--Optional:-->
            <biz:filr>?</biz:filr>
            <!--Optional:-->
            <biz:fnsChr>\n</biz:fnsChr>
         </biz:MSGIReqSubBody>
      </biz:MSGIReqBody>
   </soapenv:Body>
</soapenv:Envelope>